# DTM6_IsTypeVisible

## Description
Return true if the specified DTM type is visible of the passed DTM object.

```pascal
FUNCTION DTM6_IsTypeVisible(
				hDTMObject : HANDLE;
				TINType    : INTEGER) : BOOLEAN;
```

```python

def vs.DTM6_IsTypeVisible(hDTMObject, TINType):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hDTMObject|HANDLE||
|TINType|INTEGER||

## Version
Availability: from Vectorworks 2011
## Category
* SiteModel Interface Library